artillery.yml
config:
  target: 'https://us-central1-xmen-f6db2.cloudfunctions.net/api'
  phases:
    - duration: 10
      arrivalRate: 10
scenarios:
  - flow:
    - post:
        url: "/mutant"
        json:
          dna: ["TTGCGA", "CAGTGC", "TTATAT", "AGAAGG", "CTCCTA", "TCACTG"]
    - get:
        url: "/stats"